---
kind: property
id: P:Autodesk.Revit.DB.ElementArray.IsEmpty
source: html/91b5e6fb-386a-eed2-6c65-59342a14b304.htm
---
# Autodesk.Revit.DB.ElementArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.